src/tickets/app/controllers/events_controller.rb

INSERT INTO "events" ("artist", "description", "price_low", "price_high", "event_date", "created_at", "updated_at") VALUES ('Pratica de banda', 'Pratica de banda', 10.0, 50.0, '2025-03-17', '2025-03-16 19:09:51.274510', '2025-03-16 19:09:51.274510') RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
---
    def set_event
      @event = Event.find(params.expect(:id))