src/tickets/app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "seat_id_seq", "address", "price_paid", "email_address", "created_at", "updated_at", "phone") VALUES ('Marmitex Feijoada Pequena', '004', 'Rua das Palmeiras,123', 20.0, 'teste5@gmail.com', '2025-03-16 18:52:30.404232', '2025-03-16 18:52:30.404232', NULL) RETURNING "id"
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "updated_at" = '2025-03-16 19:05:16.591814', "phone" = '(11)986704257' WHERE "tickets"."id" = 2
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = 1
---
  def destroy
    @ticket.destroy!

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 1 LIMIT 1
---
    def set_ticket
      @ticket = Ticket.find(params.expect(:id))